import 'package:flutter_book_list/models/book.dart';

class BookRepositoy {
  final List<Book> _dummyBooks = [
    Book(
      title: '역행자 (10만 부 기념 페이크 에디션)', // ListTile 가운데 나타날 위젯
      subtitle: '돈·시간·운명으로부터 완전한 자유를 얻는 7단계 인생 공략집',
      description: """
오타쿠 흙수저에서
월 1억 자동 수익을 실현한 무자본 연쇄창업마,
라이프해커 자청의 인생 역주행 공식 대공개

대부분의 사람들은 유전자와 본성의 명령을 그대로 따르기 때문에 평범함을 벗어날 수 없다. 하지만 정작 자신은 이를 모른 채 ‘나는 달라’ 하는 자의식에 사로잡혀서 무한 합리화에 빠져 살아간다. 스스로가 얼마나 많은 정신적, 심리적 오류를 저지르는지 알지 못한 채 매일 똑같은 쳇바퀴를 돌 뿐이다. 왜 우리는 진짜 자유를 얻지 못하는가? 왜 늘 돈 이야기를 하면서도 평생 돈에 허덕이는가?

저자 역시 스무 살까지는 이런 쳇바퀴에 갇혀 있었기 때문에, 그 상황을 누구보다 잘 알았다. 자청의 첫 책 『역행자』에는 가난한 인생에서 벗어나 경제적 자유와 행복을 얻은 저자가 깨달은 인생 레벨업 치트키가 빼곡히 담겨 있다. 10대 때의 그는 외모, 돈, 공부, 그 어떤 것에서도 최하위였다. 그러던 스무 살 무렵, ‘인생에도 게임처럼 공략집이 있다’는 사실을 깨닫고 삶이 180도 바뀌기 시작한다. 200여 권의 책을 독파하며 얻은 인생의 치트키들을 활용해 창업에 연이어 성공한 것이다.

‘연봉 10억 무자본 창업가’로 유명해진 그는 2020년, 단 20개의 영상으로 10만 구독자를 넘어서며 화제를 모았으나 곧장 미련 없이 유튜브를 그만뒀다. 이후 본업인 온라인 마케팅 비즈니스를 비롯해 다방면으로 사업을 확장하고 있다. 그 사이 ‘라이프해커 자청’이라는 캐릭터와 ‘무자본 창업’이라는 개념은 사람들의 고정관념을 깨는 상징이 됐다. 자청이 찾아낸 ‘역행자의 7단계 모델’을 통해 함께 ‘인생의 추월차선’으로 향하자.니스를 설계했다. 그는 무료 홈페이지 제작 플랫폼을 통해 하루 만에 홈페이지를 제작하고, 네이버 블로그 등 SNS 채널을 통해 무료로 마케팅을 했다. 투자비용 자체가 들어가지 않는 ‘무자본 창업’ 형태였다. ‘라이프해커 자청’이라는 캐릭터와 ‘무자본 창업’이라는 개념은 사람들의 고정관념을 깨는 시그널이 됐다.

자청이 찾아낸 ‘역행자의 7단계 모델’을 통해, 부와 행복을 갈망하는 독자들은 저자가 겪은 10년 동안의 시행착오를 단 3년으로 줄일 수 있다. 못 믿겠는가? 불안과 의심을 버리고, 저자와 함께 ‘인생의 추월차선’을 타러 가보자.
        """,
      image: 'http://image.yes24.com/goods/109705390/XL',
    ),
    Book(
      title: '불편한 편의점 2', // ListTile 가운데 나타날 위젯
      subtitle: '',
      description: """
재방문을 환영합니다
여기는 청파동 ALWAYS편의점입니다

출간 후 1년이 넘도록 독자의 사랑을 받으며 베스트셀러 상위권을 지키고 있는 소설, 김호연 작가의 『불편한 편의점』이 그 두 번째 이야기로 다시 찾아왔다. 청파동 골목의 작은 편의점을 무대로 힘겨운 시대를 살아가는 우리 이웃들의 삶을 따뜻하고 유쾌하게 그린 『불편한 편의점』은 2022년 상반기 교보문고, 영풍문고, 예스24에서 집계한 종합 베스트셀러 1위와 70만 부 판매라는 대기록을 세웠다. 2021년 예스24 ‘올해의 책’에 선정되었고, 2022년에는 전국 25개 지자체에서 시민들이 참여해 뽑은 ‘올해의 책’으로 잇따라 선정되는 등 소설에 대한 관심과 열기는 지금 이 순간에도 계속되고 있다.

서울역 노숙인이 편의점의 야간 알바로 일하면서 시작되는 1편의 이야기는 예측불허의 웃음과 따스한 온기로 잔잔한 감동을 선사했다. 『불편한 편의점 2』는 전편의 위트와 속 깊은 시선을 이어가며 더욱 진득한 이야기로 독자를 끌어당긴다. 소설은 1편의 시간으로부터 1년 반이 흐른 여름날의 편의점을 스케치하며 시작된다. 그동안 세상도 달라지고 청파동의 ALWAYS편의점도 이모저모 바뀌었다. 숨이 턱턱 막히는 더위에도 마스크를 써야 하는 도입부의 묘사는 소설 속 현실에도 코로나가 있음을 짐작게 한다. 아들과의 불화로 답답해하던 선숙은 점장이 되었고, 편의점을 팔자고 조르던 염 여사의 말썽꾼 아들 민식은 사장이 되어 있다. 말이 사장이지, 민식은 경영에는 관심이 없고 수익 운운하며 주휴수당 같은 비용 줄이기에만 열을 올리니, 여러모로 ‘진짜로 불편해진’ 편의점이 아닐 수 없는데……. 그러던 중 독고의 후임으로 밤 시간을 책임지던 곽 씨가 그만두고 새 야간 알바를 구하면서 편의점은 다시 한 번 변화를 맞이한다.

새로 온 알바는 커다란 덩치와 부담스러운 행동이 누군가를 연상시키는 40대 사내. 그는 인간 알바몬이라도 되는 양 화려한 알바 경력을 자랑하지만 정작 편의점 일은 어수룩하기만 하다. 게다가 수다쟁이에 오지랖은 못 말릴 지경이어서 점장 선숙에게 핀잔을 뜯기 일쑤다. 그러거나 말거나 그는 황근배라는 이름 대신 홍금보라는 별명이 적힌 명찰을 가슴에 달고 마냥 느긋하게 손님들을 맞으며 편의점의 밤을 지켜 나간다. 
        """,
      image: 'http://image.yes24.com/goods/111088149/XL',
    ),
    Book(
      title: '하얼빈', // ListTile 가운데 나타날 위젯
      subtitle: '',
      description: """
『칼의 노래』를 넘어서는 깊이와 감동
김훈이 반드시 써내야만 했던 일생의 과업

‘우리 시대 최고의 문장가’ ‘작가들의 작가’로 일컬어지는 소설가 김훈의 신작 장편소설 『하얼빈』이 출간되었다. 『하얼빈』은 김훈이 작가로 활동하는 내내 인생 과업으로 삼아왔던 특별한 작품이다. 작가는 청년 시절부터 안중근의 짧고 강렬했던 생애를 소설로 쓰려는 구상을 품고 있었고, 안중근의 움직임이 뿜어내는 에너지를 글로 감당하기 위해 오랜 시간을 들여 ‘인간 안중근’을 깊이 이해해나갔다. 그리고 2022년 여름, 치열하고 절박한 집필 끝에 드디어 그 결과물을 세상에 내놓게 되었다.

『하얼빈』에서는 단순하게 요약되기 쉬운 실존 인물의 삶을 역사적 기록보다도 철저한 상상으로 탄탄하게 재구성하는 김훈의 글쓰기 방식이 빛을 발한다. 이러한 서사는 자연스럽게 김훈의 대표작 『칼의 노래』를 떠올리게 하는데, 『칼의 노래』가 명장으로서 이룩한 업적에 가려졌던 이순신의 요동하는 내면을 묘사했다면 『하얼빈』은 안중근에게 드리워져 있던 영웅의 그늘을 걷어내고 그의 가장 뜨겁고 혼란스러웠을 시간을 현재에 되살려놓는다.

난세를 헤쳐가야 하는 운명을 마주한 미약한 인간의 내면에 집중하는 김훈의 시선은 『하얼빈』에서 더욱 깊이 있고 오묘한 장면들을 직조해낸다. 소설 안에서 이토 히로부미로 상징되는 제국주의의 물결과 안중근으로 상징되는 청년기의 순수한 열정이 부딪치고, 살인이라는 중죄에 임하는 한 인간의 대의와 윤리가 부딪치며, 안중근이 천주교인으로서 지닌 신앙심과 속세의 인간으로서 지닌 증오심이 부딪친다. 이토록 다양한 층위에서 벌어지는 복합적인 갈등을 날렵하게 다뤄내며 안중근이라는 인물을 바라보는 시야의 차원을 높이는 이 작품은 김훈의 새로운 대표작으로 소개되기에 모자람이 없다. 
        """,
      image: 'http://image.yes24.com/goods/111085946/XL',
    ),
    Book(
      title: '아버지의 해방일지', // ListTile 가운데 나타날 위젯
      subtitle: '',
      description: """
  새삼스럽게 경탄스럽다!
  압도적인 몰입감, 가슴 먹먹한 감동
  정지아의 손끝에서 펼쳐지는 시대의 온기

  미스터리 같은 한 남자가 헤쳐온 역사의 격랑
  그 안에서 발견하는 끝끝내 강인한 우리의 인생

  김유정문학상 심훈문학대상 이효석문학상 등을 수상하며 문학성을 두루 입증받은 ‘리얼리스트’ 정지아가 무려 32년 만에 장편소설을 발표했다. 써내는 작품마다 삶의 현존을 정확하게 묘사하며 독자와 평단의 찬사를 받아온 작가는 이번에 역사의 상흔과 가족의 사랑을 엮어낸 대작을 선보임으로써 선 굵은 서사에 목마른 독자들에게 한모금 청량음료 같은 해갈을 선사한다. 탁월한 언어적 세공으로 “한국소설의 새로운 화법을 제시”(문학평론가 정홍수)하기를 거듭해온 정지아는 한 시대를 풍미한 『빨치산의 딸』(1990) 이래로 다시 초심으로 돌아가 아버지 이야기를 다룬다.

  소설은 ‘전직 빨치산’ 아버지의 죽음 이후 3일간의 시간만을 현재적 배경으로 다루지만, 장례식장에서 얽히고설킨 이야기를 따라가다보면 해방 이후 70년 현대사의 질곡이 생생하게 드러난다. 이러한 웅장한 스케일과 함께 손을 놓을 수 없는 몰입감을 동시에 안겨주는 것은 정지아만이 가능한 서사적 역량이다. 그러나 이 소설의 진정한 묘미는 어쩌면 ‘가벼움’에 있다. “아버지가 죽었다. (…) 이런 젠장”으로 시작하는 첫 챕터에서 독자들은 감을 잡겠지만 이 책은 진중한 주제의식에도 불구하고 ‘각 잡고’ 진지한 소설이 아니다. 남도의 구수한 입말로 풀어낸 일화들은 저마다 서글프지만 피식피식 웃기고, “울분이 솟다 말고 ‘긍게 사람이제’ 한마디로 가슴이 따뜻”(추천사, 김미월)해진다. 
        """,
      image: 'http://image.yes24.com/goods/112253263/XL',
    ),
    Book(
      title: '엄마의 말 연습', // ListTile 가운데 나타날 위젯
      subtitle: '화내지 않고 사랑하는 마음을 오롯이 전하는 39가지 존중어 수업',
      description: """
인스타그램 170K 팔로워, 100만 좋아요 엄마들의 선택
『초등 자존감 수업』 오뚝이샘 윤지영 작가의 엄마 말 처방전

세상에서 가장 고귀한 것이 무엇이냐고 물으면 사람들은 ‘사랑’을 말한다. 그중에서 가장 고귀한 것이 무엇이냐고 물으면 ‘자식을 향한 부모의 사랑’을 꼽는다. 자식에 대한 부모의 사랑에는 조건이 없고, 제약이 없으며, 유통기한도 없기 때문이다. 틀린 말이 아니다.

그러나 육아를 하는 엄마들의 현실은 조금 다르다. 눈에 넣어도 안 아플 것 같은 아이지만, 밥상을 차려주면 엎어버리고, 옷을 벗으면 아무 데나 던져두고, 애써 친구를 집에 초대하면 장난감을 두고 싸운다. 숙제하기 싫어서 온갖 변명거리를 창작해내고, 비싼 돈 들여 학원에 보내주면 다니기 싫다고 한다. 그런 아이에게 엄마는 사랑을 속삭이기보다 분노에 찬 말을 내뱉기 일쑤다.

“내가 너 그러지 말랬지! 정말 말 안 들을래? 나가! 나가서 네 마음대로 살아!”
엄마의 말에 아이는 금세 주눅이 든다. 그리고 엄마는 후회에 빠져든다. 상처를 주려던 건 아니었는데…….

베스트셀러 『초등 자존감 수업』을 쓴 윤지영 작가의 신작 『엄마의 말 연습』은 이처럼 나도 모르는 사이에 마음에 없는 말을 내뱉고 후회하는 엄마들을 위한 책이다. 초등학교 교사이자 두 아이의 엄마인 윤지영 작가는 직접 아이들을 키우면서 경험한 시행착오를 바탕으로 아이들에게 상처 주는 말이 무엇인지, 반대로 아이들의 자존감을 키워주는 ‘존중의 말’은 무엇인지 연구하고 분석해 한 권의 책으로 정리했다. 특히 이 책에는 잘못된 말 습관을 바로 잡을 수 있는 솔루션과 다양한 예시가 들어 있어, 말하기에 서툰 사람도 따라 읽다 보면 자연스럽게 존중의 말을 입에 익힐 수 있다.

아이는 부모의 말을 통해 사랑을 느끼고 세상 사는 법을 배운다. 오늘 사랑하는 아이에게 상처 주는 말을 하지 않았는지 되돌아보자. 그리고 『엄마의 말 연습』을 읽으며 진심을 전하는 법을 익혀보자. 씩씩하고 자존감 높은 아이로 키우는 데 이 책이 큰 도움이 될 것이다.
        """,
      image: 'http://image.yes24.com/goods/112925092/XL',
    )
  ];

  List<Book> getBook() {
    return _dummyBooks;
  }
}
